In [2]:
import pandas as pd

# Creating DataFrames from Scratch

# convert Data frames from Scratch 
#1 Construct DataFrame from dictionary of lists

In [7]:
data  = {'ProductName':['Product A','Product B','Product C','Product D'], 'ProductPrice':[22250,16600, 12500, 1122]}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500
3   Product D          1122

In [ ]:
data  = {'ProductName':['Product A','Product B','Product C','Product D'], 'ProductPrice':[22250,16600, 12500, 1122]}
df = pd.DataFrame(data)
df

###  Construct DataFrame from dictionary of lists + specify index

In [9]:
data  = {'ProductName':['Product A','Product B','Product C','Product D'], 'ProductPrice':[22250,16600, 12500, 1122]}
df = pd.DataFrame(data, index = ['A', 'b', 'c', 'd'])
df

  ProductName  ProductPrice
A   Product A         22250
b   Product B         16600
c   Product C         12500
d   Product D          1122

# Construct dataframes from list of Dictionaries

In [15]:
data = [{'ProductName': 'Product A', 'ProductPrice':22250},
        {'ProductName': 'Product A', 'ProductPrice':22250},
        {'ProductName': 'Product A', 'ProductPrice':22250}
        ,{'ProductName': 'Product A', 'ProductPrice':22250}]
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product A         22250
2   Product A         22250
3   Product A         22250

In [17]:
data = [{'ProductName': 'Product A', 'ProductPrice':22250},
        {'ProductName': 'Product A', 'ProductPrice':22250},
        {'ProductName': 'Product A', 'ProductPrice':22250}
        ,{'ProductName': 'Product A', 'ProductPrice':[{'ProductName': 'Product A', 'ProductPrice':22250}]}]
df = pd.DataFrame(data)
df

  ProductName                                       ProductPrice
0   Product A                                              22250
1   Product A                                              22250
2   Product A                                              22250
3   Product A  [{'ProductName': 'Product A', 'ProductPrice': ...

# Construct data frames from dictionary of pandas series

In [18]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'])
ser_prices = pd.Series([22250, 16600, 12500])
ser_products

0    Product A
1    Product B
2    Product C
dtype: object

In [19]:
ser_prices

0    22250
1    16600
2    12500
dtype: int64

In [21]:
data = {'productName':ser_products, 'ProductPrice':ser_prices}
df = pd.DataFrame(data)
df

  productName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [25]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500],  index = ['A', 'B', 'C'])
data = {'ProductName': ser_products, 'ProductPrice':ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [32]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['C', 'B', 'A'])
ser_prices = pd.Series([22250, 16600, 12500], index = ['A', 'B', 'C'])
data = {'ProductName': ser_products, 'ProductPrice':ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product C         22250
B   Product B         16600
C   Product A         12500

## Construct a DataFrame from a list of lissts

In [45]:
data = [['Product A', 22250],['Product B', 22250],['Product C', 22250]]
df = pd.DataFrame(data)
df.columns = ['ProductName','ProductPrice']
df.index = ['a','b','c']
df

  ProductName  ProductPrice
a   Product A         22250
b   Product B         22250
c   Product C         22250

In [37]:
data = [['Product A', 2225110],['Product B', 2223250],['Product C', 22250, 1.,4]]
df = pd.DataFrame(data)
df

           0        1    2    3
0  Product A  2225110  NaN  NaN
1  Product B  2223250  NaN  NaN
2  Product C    22250  1.0  4.0

## Creating Dataframe in a professional way

In [46]:
df  = pd.DataFrame(data = [['Product A', 22250], ['Product A', 22250], ['Product A', 22250]],
                  columns = ['ProductName', 'ProductPrice'],
                  index = ['A','B', 'C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product A         22250
C   Product A         22250

In [ ]:
DF.SHA